zephyrproject-rtos/hal_nxp/mcux/drivers/kinetis/fsl_tsi_v2.h
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef _FSL_TSI_V2_H_
#define _FSL_TSI_V2_H_

#include "fsl_common.h"

/*!
 * @addtogroup tsi_v2_driver
 * @{
 */


/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief TSI driver version */
#define FSL_TSI_DRIVER_VERSION (MAKE_VERSION(2, 1, 2))
/*@}*/

/*! @brief TSI status flags macro collection */
#define ALL_FLAGS_MASK  (TSI_GENCS_EOSF_MASK   |\
                         TSI_GENCS_OUTRGF_MASK |\
                         TSI_GENCS_EXTERF_MASK  |\
                         TSI_GENCS_OVRF_MASK)


/*!
 * @brief TSI number of scan intervals for each electrode.
 *
 * These constants define the TSI number of consecutive scans in a TSI instance for each electrode.
 */
typedef enum _tsi_n_consecutive_scans
{
    kTSI_ConsecutiveScansNumber_1time = 0U,   /*!< Once per electrode */
    kTSI_ConsecutiveScansNumber_2time = 1U,   /*!< Twice per electrode */
    kTSI_ConsecutiveScansNumber_3time = 2U,   /*!< 3 times consecutive scan */
    kTSI_ConsecutiveScansNumber_4time = 3U,   /*!< 4 times consecutive scan */
    kTSI_ConsecutiveScansNumber_5time = 4U,   /*!< 5 times consecutive scan */
    kTSI_ConsecutiveScansNumber_6time = 5U,   /*!< 6 times consecutive scan */
    kTSI_ConsecutiveScansNumber_7time = 6U,   /*!< 7 times consecutive scan */
    kTSI_ConsecutiveScansNumber_8time = 7U,   /*!< 8 times consecutive scan */
    kTSI_ConsecutiveScansNumber_9time = 8U,   /*!< 9 times consecutive scan */
    kTSI_ConsecutiveScansNumber_10time = 9U,  /*!< 10 times consecutive scan */
    kTSI_ConsecutiveScansNumber_11time = 10U, /*!< 11 times consecutive scan */
    kTSI_ConsecutiveScansNumber_12time = 11U, /*!< 12 times consecutive scan */
    kTSI_ConsecutiveScansNumber_13time = 12U, /*!< 13 times consecutive scan */
    kTSI_ConsecutiveScansNumber_14time = 13U, /*!< 14 times consecutive scan */
    kTSI_ConsecutiveScansNumber_15time = 14U, /*!< 15 times consecutive scan */
    kTSI_ConsecutiveScansNumber_16time = 15U, /*!< 16 times consecutive scan */
    kTSI_ConsecutiveScansNumber_17time = 16U, /*!< 17 times consecutive scan */
    kTSI_ConsecutiveScansNumber_18time = 17U, /*!< 18 times consecutive scan */
    kTSI_ConsecutiveScansNumber_19time = 18U, /*!< 19 times consecutive scan */
    kTSI_ConsecutiveScansNumber_20time = 19U, /*!< 20 times consecutive scan */
    kTSI_ConsecutiveScansNumber_21time = 20U, /*!< 21 times consecutive scan */
    kTSI_ConsecutiveScansNumber_22time = 21U, /*!< 22 times consecutive scan */
    kTSI_ConsecutiveScansNumber_23time = 22U, /*!< 23 times consecutive scan */
    kTSI_ConsecutiveScansNumber_24time = 23U, /*!< 24 times consecutive scan */
    kTSI_ConsecutiveScansNumber_25time = 24U, /*!< 25 times consecutive scan */
    kTSI_ConsecutiveScansNumber_26time = 25U, /*!< 26 times consecutive scan */
    kTSI_ConsecutiveScansNumber_27time = 26U, /*!< 27 times consecutive scan */
    kTSI_ConsecutiveScansNumber_28time = 27U, /*!< 28 times consecutive scan */
    kTSI_ConsecutiveScansNumber_29time = 28U, /*!< 29 times consecutive scan */
    kTSI_ConsecutiveScansNumber_30time = 29U, /*!< 30 times consecutive scan */
    kTSI_ConsecutiveScansNumber_31time = 30U, /*!< 31 times consecutive scan */
    kTSI_ConsecutiveScansNumber_32time = 31U  /*!< 32 times consecutive scan */
} tsi_n_consecutive_scans_t;

/*!
 * @brief TSI electrode oscillator prescaler.
 *
 * These constants define the TSI electrode oscillator prescaler in a TSI instance.
 */
typedef enum _tsi_electrode_osc_prescaler
{
    kTSI_ElecOscPrescaler_1div = 0U,  /*!< Electrode oscillator frequency divided by 1 */
    kTSI_ElecOscPrescaler_2div = 1U,  /*!< Electrode oscillator frequency divided by 2 */
    kTSI_ElecOscPrescaler_4div = 2U,  /*!< Electrode oscillator frequency divided by 4 */
    kTSI_ElecOscPrescaler_8div = 3U,  /*!< Electrode oscillator frequency divided by 8 */
    kTSI_ElecOscPrescaler_16div = 4U, /*!< Electrode oscillator frequency divided by 16 */
    kTSI_ElecOscPrescaler_32div = 5U, /*!< Electrode oscillator frequency divided by 32 */
    kTSI_ElecOscPrescaler_64div = 6U, /*!< Electrode oscillator frequency divided by 64 */
    kTSI_ElecOscPrescaler_128div = 7U /*!< Electrode oscillator frequency divided by 128 */
} tsi_electrode_osc_prescaler_t;

/*!
 * @brief TSI low power mode clock source.
 */
typedef enum _tsi_low_power_clock_source
{
    kTSI_LowPowerClockSource_LPOCLK = 0U,   /*!< LPOCLK is selected */
    kTSI_LowPowerClockSource_VLPOSCCLK = 1U /*!< VLPOSCCLK is selected */
} tsi_low_power_clock_source_t;

/*!
 * @brief TSI low power scan intervals.
 *
 * These constants define the TSI low power scan intervals in a TSI instance.
 */
typedef enum _tsi_low_power_scan_interval
{
    kTSI_LowPowerInterval_1ms = 0U,    /*!< 1 ms scan interval */
    kTSI_LowPowerInterval_5ms = 1U,    /*!< 5 ms scan interval */
    kTSI_LowPowerInterval_10ms = 2U,   /*!< 10 ms scan interval */
    kTSI_LowPowerInterval_15ms = 3U,   /*!< 15 ms scan interval */
    kTSI_LowPowerInterval_20ms = 4U,   /*!< 20 ms scan interval */
    kTSI_LowPowerInterval_30ms = 5U,   /*!< 30 ms scan interval */
    kTSI_LowPowerInterval_40ms = 6U,   /*!< 40 ms scan interval */
    kTSI_LowPowerInterval_50ms = 7U,   /*!< 50 ms scan interval */
    kTSI_LowPowerInterval_75ms = 8U,   /*!< 75 ms scan interval */
    kTSI_LowPowerInterval_100ms = 9U,  /*!< 100 ms scan interval */
    kTSI_LowPowerInterval_125ms = 10U, /*!< 125 ms scan interval */
    kTSI_LowPowerInterval_150ms = 11U, /*!< 150 ms scan interval */
    kTSI_LowPowerInterval_200ms = 12U, /*!< 200 ms scan interval */
    kTSI_LowPowerInterval_300ms = 13U, /*!< 300 ms scan interval */
    kTSI_LowPowerInterval_400ms = 14U, /*!< 400 ms scan interval */
    kTSI_LowPowerInterval_500ms = 15U  /*!< 500 ms scan interval */
} tsi_low_power_scan_interval_t;

/*!
 * @brief TSI Reference oscillator charge current select.
 *
 * These constants define the TSI Reference oscillator charge current select in a TSI instance.
 */
typedef enum _tsi_reference_osc_charge_current
{
    kTSI_RefOscChargeCurrent_2uA = 0U,   /*!< Reference oscillator charge current is 2 µA */
    kTSI_RefOscChargeCurrent_4uA = 1U,   /*!< Reference oscillator charge current is 4 µA */
    kTSI_RefOscChargeCurrent_6uA = 2U,   /*!< Reference oscillator charge current is 6 µA */
    kTSI_RefOscChargeCurrent_8uA = 3U,   /*!< Reference oscillator charge current is 8 µA */
    kTSI_RefOscChargeCurrent_10uA = 4U,  /*!< Reference oscillator charge current is 10 µA */
    kTSI_RefOscChargeCurrent_12uA = 5U,  /*!< Reference oscillator charge current is 12 µA */
    kTSI_RefOscChargeCurrent_14uA = 6U,  /*!< Reference oscillator charge current is 14 µA */
    kTSI_RefOscChargeCurrent_16uA = 7U,  /*!< Reference oscillator charge current is 16 µA */
    kTSI_RefOscChargeCurrent_18uA = 8U,  /*!< Reference oscillator charge current is 18 µA */
    kTSI_RefOscChargeCurrent_20uA = 9U,  /*!< Reference oscillator charge current is 20 µA */
    kTSI_RefOscChargeCurrent_22uA = 10U, /*!< Reference oscillator charge current is 22 µA */
    kTSI_RefOscChargeCurrent_24uA = 11U, /*!< Reference oscillator charge current is 24 µA */
    kTSI_RefOscChargeCurrent_26uA = 12U, /*!< Reference oscillator charge current is 26 µA */
    kTSI_RefOscChargeCurrent_28uA = 13U, /*!< Reference oscillator charge current is 28 µA */
    kTSI_RefOscChargeCurrent_30uA = 14U, /*!< Reference oscillator charge current is 30 µA */
    kTSI_RefOscChargeCurrent_32uA = 15U  /*!< Reference oscillator charge current is 32 µA */
} tsi_reference_osc_charge_current_t;

/*!
 * @brief TSI External oscillator charge current select.
 *
 * These constants define the TSI External oscillator charge current select in a TSI instance.
 */
typedef enum _tsi_external_osc_charge_current
{
    kTSI_ExtOscChargeCurrent_2uA = 0U,   /*!< External oscillator charge current is 2 µA */
    kTSI_ExtOscChargeCurrent_4uA = 1U,   /*!< External oscillator charge current is 4 µA */
    kTSI_ExtOscChargeCurrent_6uA = 2U,   /*!< External oscillator charge current is 6 µA */
    kTSI_ExtOscChargeCurrent_8uA = 3U,   /*!< External oscillator charge current is 8 µA */
    kTSI_ExtOscChargeCurrent_10uA = 4U,  /*!< External oscillator charge current is 10 µA */
    kTSI_ExtOscChargeCurrent_12uA = 5U,  /*!< External oscillator charge current is 12 µA */
    kTSI_ExtOscChargeCurrent_14uA = 6U,  /*!< External oscillator charge current is 14 µA */
    kTSI_ExtOscChargeCurrent_16uA = 7U,  /*!< External oscillator charge current is 16 µA */
    kTSI_ExtOscChargeCurrent_18uA = 8U,  /*!< External oscillator charge current is 18 µA */
    kTSI_ExtOscChargeCurrent_20uA = 9U,  /*!< External oscillator charge current is 20 µA */
    kTSI_ExtOscChargeCurrent_22uA = 10U, /*!< External oscillator charge current is 22 µA */
    kTSI_ExtOscChargeCurrent_24uA = 11U, /*!< External oscillator charge current is 24 µA */
    kTSI_ExtOscChargeCurrent_26uA = 12U, /*!< External oscillator charge current is 26 µA */
    kTSI_ExtOscChargeCurrent_28uA = 13U, /*!< External oscillator charge current is 28 µA */
    kTSI_ExtOscChargeCurrent_30uA = 14U, /*!< External oscillator charge current is 30 µA */
    kTSI_ExtOscChargeCurrent_32uA = 15U  /*!< External oscillator charge current is 32 µA */
} tsi_external_osc_charge_current_t;

/*!
 * @brief TSI Active mode clock source.
 *
 * These constants define the active mode clock source in a TSI instance.
 */
typedef enum _tsi_active_mode_clock_source
{
    kTSI_ActiveClkSource_LPOSCCLK = 0U, /*!< Active mode clock source is set to LPOOSC Clock */
    kTSI_ActiveClkSource_MCGIRCLK = 1U, /*!< Active mode clock source is set to MCG Internal reference clock */
    kTSI_ActiveClkSource_OSCERCLK = 2U  /*!< Active mode clock source is set to System oscillator output */
} tsi_active_mode_clock_source_t;

/*!
 * @brief TSI active mode prescaler.
 *
 * These constants define the TSI active mode prescaler in a TSI instance.
 */
typedef enum _tsi_active_mode_prescaler
{
    kTSI_ActiveModePrescaler_1div = 0U,  /*!< Input clock source divided by 1 */
    kTSI_ActiveModePrescaler_2div = 1U,  /*!< Input clock source divided by 2 */
    kTSI_ActiveModePrescaler_4div = 2U,  /*!< Input clock source divided by 4 */
    kTSI_ActiveModePrescaler_8div = 3U,  /*!< Input clock source divided by 8 */
    kTSI_ActiveModePrescaler_16div = 4U, /*!< Input clock source divided by 16 */
    kTSI_ActiveModePrescaler_32div = 5U, /*!< Input clock source divided by 32 */
    kTSI_ActiveModePrescaler_64div = 6U, /*!< Input clock source divided by 64 */
    kTSI_ActiveModePrescaler_128div = 7U /*!< Input clock source divided by 128 */
} tsi_active_mode_prescaler_t;

