zephyrproject-rtos/hal_nxp/mcux/drivers/kinetis/fsl_tsi_v2.h
/*! @brief TSI status flags. */
typedef enum _tsi_status_flags
{
    kTSI_EndOfScanFlag = TSI_GENCS_EOSF_MASK,                /*!< End-Of-Scan flag */
    kTSI_OutOfRangeFlag = TSI_GENCS_OUTRGF_MASK,             /*!< Out-Of-Range flag */
    kTSI_ExternalElectrodeErrorFlag = TSI_GENCS_EXTERF_MASK, /*!< External electrode error flag */
    kTSI_OverrunErrorFlag = TSI_GENCS_OVRF_MASK              /*!< Overrun error flag  */
} tsi_status_flags_t;

/*! @brief TSI feature interrupt source.*/
typedef enum _tsi_interrupt_enable
{
    kTSI_GlobalInterruptEnable = 1U,     /*!< TSI module global interrupt */
    kTSI_OutOfRangeInterruptEnable = 2U, /*!< Out-Of-Range interrupt */
    kTSI_EndOfScanInterruptEnable = 4U,  /*!< End-Of-Scan interrupt */
    kTSI_ErrorInterrruptEnable = 8U      /*!< Error interrupt */
} tsi_interrupt_enable_t;

/*! @brief TSI calibration data storage. */
typedef struct _tsi_calibration_data
{
    uint16_t calibratedData[FSL_FEATURE_TSI_CHANNEL_COUNT]; /*!< TSI calibration data storage buffer */
} tsi_calibration_data_t;

/*!
 * @brief TSI configuration structure.
 *
 * This structure contains the settings for the most common TSI configurations including
 * the TSI module charge currents, number of scans, thresholds, and so on.
 */
typedef struct _tsi_config
{
    uint16_t thresh;                            /*!< High threshold. */
    uint16_t thresl;                            /*!< Low threshold. */
    tsi_low_power_clock_source_t lpclks;        /*!< Low power clock. */
    tsi_low_power_scan_interval_t lpscnitv;     /*!< Low power scan interval. */
    tsi_active_mode_clock_source_t amclks;      /*!< Active mode clock source. */
    tsi_active_mode_prescaler_t ampsc;          /*!< Active mode prescaler. */
    tsi_electrode_osc_prescaler_t ps;           /*!< Electrode Oscillator Prescaler */
    tsi_external_osc_charge_current_t extchrg;  /*!< External Oscillator charge current */
    tsi_reference_osc_charge_current_t refchrg; /*!< Reference Oscillator charge current */
    tsi_n_consecutive_scans_t nscn;             /*!< Number of scans. */
} tsi_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/*!
 * @brief Initializes hardware.
 *
 * @details Initializes the peripheral to the targeted state specified by the parameter configuration,
 *          such as initialize and set prescalers, number of scans, clocks, delta voltage
 *          capacitance trimmer, reference, and electrode charge current and threshold.
 *
 * @param   base    TSI peripheral base address.
 * @param   config  Pointer to the TSI peripheral configuration structure.
 * @return none
 */
void TSI_Init(TSI_Type *base, const tsi_config_t *config);

/*!
 * @brief De-initializes hardware.
 *
 * @details De-initializes the peripheral to default state.
 *
 * @param  base  TSI peripheral base address.
 * @return none
 */
void TSI_Deinit(TSI_Type *base);

/*!
 * @brief Gets TSI normal mode user configuration structure.
 * This interface sets the userConfig structure to a default value. The configuration structure only
 * includes the settings for the whole TSI.
 * The user configure is set to these values:
 * @code
    userConfig.lpclks = kTSI_LowPowerClockSource_LPOCLK;
    userConfig.lpscnitv = kTSI_LowPowerInterval_100ms;
    userConfig.amclks = kTSI_ActiveClkSource_LPOSCCLK;
    userConfig.ampsc = kTSI_ActiveModePrescaler_8div;
    userConfig.ps = kTSI_ElecOscPrescaler_2div;
    userConfig.extchrg = kTSI_ExtOscChargeCurrent_10uA;
    userConfig.refchrg = kTSI_RefOscChargeCurrent_10uA;
    userConfig.nscn = kTSI_ConsecutiveScansNumber_8time;
    userConfig.thresh = 0U;
    userConfig.thresl = 0U;
   @endcode
 *
 * @param userConfig Pointer to the TSI user configuration structure.
 */
void TSI_GetNormalModeDefaultConfig(tsi_config_t *userConfig);

/*!
 * @brief Gets the TSI low power mode default user configuration structure.
 * This interface sets userConfig structure to a default value. The configuration structure only
 * includes the settings for the whole TSI.
 * The user configure is set to these values:
 * @code
    userConfig.lpclks = kTSI_LowPowerClockSource_LPOCLK;
    userConfig.lpscnitv = kTSI_LowPowerInterval_100ms;
    userConfig.amclks = kTSI_ActiveClkSource_LPOSCCLK;
    userConfig.ampsc = kTSI_ActiveModePrescaler_64div;
    userConfig.ps = kTSI_ElecOscPrescaler_1div;
    userConfig.extchrg = kTSI_ExtOscChargeCurrent_2uA;
    userConfig.refchrg = kTSI_RefOscChargeCurrent_32uA;
    userConfig.nscn = kTSI_ConsecutiveScansNumber_26time;
    userConfig.thresh = 15000U;
    userConfig.thresl = 1000U;
   @endcode
 *
 * @param userConfig Pointer to the TSI user configuration structure.
 */
void TSI_GetLowPowerModeDefaultConfig(tsi_config_t *userConfig);

/*!
 * @brief Hardware calibration.
 *
 * @details Calibrates the peripheral to fetch the initial counter value of the enabled electrodes.
 *          This API is mostly used at the initial application setup. Call this function after the \ref TSI_Init API
 *          and use the calibrated counter values to set up applications
 *          (such as to determine under which counter value a touch event occurs).
 *
 * @note    This API is called in normal power modes.
 * @note    For K60 series, the calibrated baseline counter value CANNOT be used in low power modes. To obtain
 *          the calibrated counter values in low power modes, see K60 Mask Set Errata for Mask 5N22D.
 * @param   base   TSI peripheral base address.
 * @param   calBuff Data buffer that store the calibrated counter value.
 * @return  none
 *
 */
void TSI_Calibrate(TSI_Type *base, tsi_calibration_data_t *calBuff);

/*!
 * @brief Enables the TSI interrupt requests.
 * @param base TSI peripheral base address.
 * @param mask interrupt source
 *     The parameter can be a combination of the following source if defined:
 *     @arg kTSI_GlobalInterruptEnable
 *     @arg kTSI_EndOfScanInterruptEnable
 *     @arg kTSI_OutOfRangeInterruptEnable
 *     @arg kTSI_ErrorInterrruptEnable
 */
void TSI_EnableInterrupts(TSI_Type *base, uint32_t mask);

/*!
 * @brief Disables the TSI interrupt requests.
 * @param base TSI peripheral base address.
 * @param mask interrupt source
 *     The parameter can be a combination of the following source if defined:
 *     @arg kTSI_GlobalInterruptEnable
 *     @arg kTSI_EndOfScanInterruptEnable
 *     @arg kTSI_OutOfRangeInterruptEnable
 *     @arg kTSI_ErrorInterrruptEnable
 */
void TSI_DisableInterrupts(TSI_Type *base, uint32_t mask);

/*!
* @brief Gets the interrupt flags.
* This function get TSI interrupt flags.
*
* @param   base  TSI peripheral base address.
* @return        The mask of these status flag bits.
*/
static inline uint32_t TSI_GetStatusFlags(TSI_Type *base)
{
    return (base->GENCS &
            (kTSI_EndOfScanFlag | kTSI_OutOfRangeFlag | kTSI_ExternalElectrodeErrorFlag | kTSI_OverrunErrorFlag));
}

/*!
 * @brief Clears the interrupt flags.
 *
 * This function clears the TSI interrupt flags.
 * @note The automatically cleared flags can't be cleared by this function.
 *
 * @param base TSI peripheral base address.
 * @param mask the status flags to clear.
 */
void TSI_ClearStatusFlags(TSI_Type *base, uint32_t mask);

/*!
* @brief Gets the TSI scan trigger mode.
*
* @param  base  TSI peripheral base address.
* @return       Scan trigger mode.
*/
static inline uint32_t TSI_GetScanTriggerMode(TSI_Type *base)
{
    return (base->GENCS & TSI_GENCS_STM_MASK);
}

/*!
* @brief Gets the scan in progress flag.
*
* @param    base TSI peripheral base address.
* @return   True - if scan is in progress.
*           False - if scan is not in progress.
*/
static inline bool TSI_IsScanInProgress(TSI_Type *base)
{
    return (base->GENCS & TSI_GENCS_SCNIP_MASK);
}

/*!
* @brief Sets the electrode oscillator prescaler.
*
* @param   base       TSI peripheral base address.
* @param   prescaler  Prescaler value.
* @return  none.
*/
static inline void TSI_SetElectrodeOSCPrescaler(TSI_Type *base, tsi_electrode_osc_prescaler_t prescaler)
{
    base->GENCS = (base->GENCS & ~(TSI_GENCS_PS_MASK | ALL_FLAGS_MASK)) | (TSI_GENCS_PS(prescaler));
}

/*!
* @brief Sets the number of scans (NSCN).
*
* @param   base   TSI peripheral base address.
* @param   number Number of scans.
* @return  none.
*/
static inline void TSI_SetNumberOfScans(TSI_Type *base, tsi_n_consecutive_scans_t number)
{
    base->GENCS = (base->GENCS & ~(TSI_GENCS_NSCN_MASK | ALL_FLAGS_MASK)) | (TSI_GENCS_NSCN(number));
}

/*!
* @brief Enables/disables the TSI module.
*
* @param    base TSI peripheral base address.
* @param    enable  Choose whether to enable TSI module.
*                   - true  Enable module;
*                   - false Disable module;
* @return   none.
*/
static inline void TSI_EnableModule(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) | TSI_GENCS_TSIEN_MASK;    /* Enable module */
    }
    else
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) & (~TSI_GENCS_TSIEN_MASK); /* Disable module */
    }
}

/*!
* @brief    Enables/disables the TSI module in low power stop mode.
*
* @param    base TSI peripheral base address.
* @param    enable  Choose whether to enable TSI module in low power modes.
*                   - true  Enable module in low power modes;
*                   - false Disable module in low power modes;
* @return   none.
*/
static inline void TSI_EnableLowPower(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) | TSI_GENCS_STPE_MASK;    /* Enable module in low power stop mode */
    }
    else
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) & (~TSI_GENCS_STPE_MASK); /* Disable module in low power stop mode */
    }
}

/*!
* @brief Enables/disables the periodical (hardware) trigger scan.
*
* @param    base TSI peripheral base address.
* @param    enable  Choose whether to enable periodical trigger scan.
*                   - true  Enable periodical trigger scan;
*                   - false Enable software trigger scan;
* @return   none.
*/
static inline void TSI_EnablePeriodicalScan(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) | TSI_GENCS_STM_MASK;    /* Enable period trigger scan */
    }
    else
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) & (~TSI_GENCS_STM_MASK); /* Enable software trigger scan */
    }
}

/*!
* @brief Starts a measurement (trigger a new measurement).
*
* @param    base TSI peripheral base address.
* @return   none.
*/
static inline void TSI_StartSoftwareTrigger(TSI_Type *base)
{
    base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) | TSI_GENCS_SWTS_MASK;
}

/*!
* @brief Sets a low power scan interval.
*
* @param  base      TSI peripheral base address.
* @param  interval  Interval for low power scan.
* @return none.
*/
static inline void TSI_SetLowPowerScanInterval(TSI_Type *base, tsi_low_power_scan_interval_t interval)
{
    base->GENCS = (base->GENCS & ~(TSI_GENCS_LPSCNITV_MASK | ALL_FLAGS_MASK)) | (TSI_GENCS_LPSCNITV(interval));
}

/*!
* @brief Sets a low power clock.
*
* @param base  TSI peripheral base address.
* @param clock Low power clock selection.
*/
static inline void TSI_SetLowPowerClock(TSI_Type *base, uint32_t clock)
{
    base->GENCS = (base->GENCS & ~(TSI_GENCS_LPCLKS_MASK | ALL_FLAGS_MASK)) | (TSI_GENCS_LPCLKS(clock));
}

/*!
* @brief Sets the reference oscillator charge current.
*
* @param  base    TSI peripheral base address.
* @param  current The reference oscillator charge current.
* @return none.
*/
static inline void TSI_SetReferenceChargeCurrent(TSI_Type *base, tsi_reference_osc_charge_current_t current)
{
    base->SCANC = ((base->SCANC) & ~TSI_SCANC_REFCHRG_MASK) | (TSI_SCANC_REFCHRG(current));
}

/*!
* @brief Sets the electrode charge current.
*
* @param    base    TSI peripheral base address.
* @param    current The external electrode charge current.
* @return   none.
*/
static inline void TSI_SetElectrodeChargeCurrent(TSI_Type *base, tsi_external_osc_charge_current_t current)
{
    base->SCANC = ((base->SCANC) & ~TSI_SCANC_EXTCHRG_MASK) | (TSI_SCANC_EXTCHRG(current));
}

/*!
* @brief Sets the scan modulo value.
*
* @param    base    TSI peripheral base address.
* @param    modulo  Scan modulo value.
* @return   none.
*/
static inline void TSI_SetScanModulo(TSI_Type *base, uint32_t modulo)
{
    base->SCANC = ((base->SCANC) & ~TSI_SCANC_SMOD_MASK) | (TSI_SCANC_SMOD(modulo));
}

/*!
* @brief Sets the active mode source.
*
* @param    base    TSI peripheral base address.
* @param    source  Active mode clock source (LPOSCCLK, MCGIRCLK, OSCERCLK).
* @return   none.
*/
static inline void TSI_SetActiveModeSource(TSI_Type *base, uint32_t source)
{
    base->SCANC = ((base->SCANC) & ~TSI_SCANC_AMCLKS_MASK) | (TSI_SCANC_AMCLKS(source));
}

/*!
* @brief Sets the active mode prescaler.
*
* @param    base       TSI peripheral base address.
* @param    prescaler  Prescaler value.
* @return   none.
*/
static inline void TSI_SetActiveModePrescaler(TSI_Type *base, tsi_active_mode_prescaler_t prescaler)
{
    base->SCANC = ((base->SCANC) & ~TSI_SCANC_AMPSC_MASK) | (TSI_SCANC_AMPSC(prescaler));
}

/*!
* @brief Sets the low power channel.
*        Only one channel can be enabled in low power mode.
*
* @param    base    TSI peripheral base address.
* @param    channel Channel number.
* @return   none.
*/
static inline void TSI_SetLowPowerChannel(TSI_Type *base, uint16_t channel)
{
    assert(channel < FSL_FEATURE_TSI_CHANNEL_COUNT);

    base->PEN = ((base->PEN) & ~TSI_PEN_LPSP_MASK) | (TSI_PEN_LPSP(channel));
}

/*!
 * @brief  Gets the enabled channel in low power modes.
 * @note   Only one channel can be enabled in low power mode.
 *
 * @param  base TSI peripheral base address.
 * @return      Channel number.
 */
static inline uint32_t TSI_GetLowPowerChannel(TSI_Type *base)
{
    return ((base->PEN & TSI_PEN_LPSP_MASK) >> TSI_PEN_LPSP_SHIFT);
}

/*!
* @brief Enables/disables a channel.
*
* @param    base    TSI peripheral base address.
* @param    channel Channel to be enabled.
* @param    enable  Choose whether to enable specific channel.
*                   - true  Enable the specific channel;
*                   - false Disable the specific channel;
* @return   none.
*/
static inline void TSI_EnableChannel(TSI_Type *base, uint16_t channel, bool enable)
{
    assert(channel < FSL_FEATURE_TSI_CHANNEL_COUNT);

    if (enable)
    {
        base->PEN |= (1U << channel); /* Enable this specific channel */
    }
    else
    {
        base->PEN &= ~(1U << channel); /* Disable this specific channel */
    }
}

/*!
* @brief Enables/disables channels.
* The function enables or disables channels by mask. It can enable/disable all channels at once.
*
* @param    base         TSI peripheral base address.
* @param    channelsMask Channels mask that indicate channels that are to be enabled/disabled.
* @param    enable  Choose to enable or disable the specified channels.
*                   - true  Enable the specified channels;
*                   - false Disable the specified channels;
* @return   none.
*/
static inline void TSI_EnableChannels(TSI_Type *base, uint16_t channelsMask, bool enable)
{
    if (enable)
    {
        base->PEN |= channelsMask; /* Enable these specified channels */
    }
    else
    {
        base->PEN &= ~(0x0000FFFFU & (uint32_t)channelsMask); /* Disable these specified channels */
    }
}

/*!
 * @brief Returns if a channel is enabled.
 *
 * @param   base    TSI peripheral base address.
 * @param   channel Channel to be checked.
 *
 * @return true  - if the channel is enabled;
 *         false - if the channel is disabled;
 */
static inline bool TSI_IsChannelEnabled(TSI_Type *base, uint16_t channel)
{
    assert(channel < FSL_FEATURE_TSI_CHANNEL_COUNT);

