zephyrproject-rtos/hal_nxp/mcux/drivers/kinetis/fsl_tsi_v2.h
    return ((base->PEN) & (1U << channel));
}

/*!
* @brief Returns the mask of enabled channels.
*
* @param   base  TSI peripheral base address.
* @return        Channels mask that indicates currently enabled channels.
*/
static inline uint16_t TSI_GetEnabledChannels(TSI_Type *base)
{
    return (uint16_t)(base->PEN & 0x0000FFFFU);
}

/*!
* @brief Gets the wake up channel counter for low-power mode usage.
*
* @param   base  TSI peripheral base address.
* @return        Wake up counter value.
*/
static inline uint16_t TSI_GetWakeUpChannelCounter(TSI_Type *base)
{
    return (uint16_t)base->WUCNTR;
}

/*!
* @brief Gets the TSI conversion counter of a specific channel in normal mode.
* @note    This API can only be used in normal active modes.
*
* @param   base    TSI peripheral base address.
* @param   channel Index of the specific TSI channel.
*
* @return   The counter value of the specific channel.
*/
static inline uint16_t TSI_GetNormalModeCounter(TSI_Type *base, uint16_t channel)
{
    assert(channel < FSL_FEATURE_TSI_CHANNEL_COUNT);

    uint16_t *counter = (uint16_t *)((uint32_t)(&(((base)->CNTR1))) + (channel * 2U));
    return (uint16_t)(*counter);
}

/*!
* @brief Sets a low threshold.
*
* @param    base           TSI peripheral base address.
* @param    low_threshold  Low counter threshold.
* @return   none.
*/
static inline void TSI_SetLowThreshold(TSI_Type *base, uint16_t low_threshold)
{
    base->THRESHOLD = ((base->THRESHOLD) & ~TSI_THRESHOLD_LTHH_MASK) | (TSI_THRESHOLD_LTHH(low_threshold));
}

/*!
* @brief Sets a high threshold.
*
* @param    base            TSI peripheral base address.
* @param    high_threshold  High counter threshold.
* @return   none.
*/
static inline void TSI_SetHighThreshold(TSI_Type *base, uint16_t high_threshold)
{
    base->THRESHOLD = ((base->THRESHOLD) & ~TSI_THRESHOLD_HTHH_MASK) | (TSI_THRESHOLD_HTHH(high_threshold));
}

#ifdef __cplusplus
}
#endif /* __cplusplus */

/*! @}*/

#endif /* _FSL_TSI_V2_H_*/
